PhracturedBlue/ESP8266MQTTMesh/src/ESP8266MQTTMesh.cpp
    mqttClient.setServer(mqtt_server, mqtt_port);
    if (mqtt_username || mqtt_password)
        mqttClient.setCredentials(mqtt_username, mqtt_password);

#if ASYNC_TCP_SSL_ENABLED
    mqttClient.setSecure(mqtt_secure);
    if (mqtt_fingerprint) {
        mqttClient.addServerFingerprint(mqtt_fingerprint);
    }
#endif
    //mqttClient.setCallback([this] (char* topic, byte* payload, unsigned int length) { this->mqtt_callback(topic, payload, length); });


    dbgPrintln(EMMDBG_WIFI_EXTRA, WiFi.status());
    dbgPrintln(EMMDBG_MSG_EXTRA, "Setup Complete");
    ap_ptr = NULL;
    connect();
}

#ifdef USE_WIFI_ONEVENT
//The ESP32 does not support the std::function onEvent variants

static ESP8266MQTTMesh *meshPtr;

void staticWiFiEventHandler(system_event_id_t event, system_event_info_t info)
{
    meshPtr->WiFiEventHandler(event, info);
}

void ESP8266MQTTMesh::WiFiEventHandler(system_event_id_t event, system_event_info_t info)
{
    switch(event) {
    case SYSTEM_EVENT_STA_GOT_IP:
    {
        struct WiFiEventStationModeGotIP e;
        e.ip = info.got_ip.ip_info.ip.addr;
        e.mask = info.got_ip.ip_info.netmask.addr;
        e.gw = info.got_ip.ip_info.gw.addr;
        this->onWifiConnect(e);
        break;
    }
    case SYSTEM_EVENT_STA_DISCONNECTED:
    {
        struct WiFiEventStationModeDisconnected e;
        e.ssid.reserve(info.disconnected.ssid_len+1);
        for(int i = 0; i < info.disconnected.ssid_len; i++) {
            e.ssid += (char)info.disconnected.ssid[i];
        }
        memcpy(e.bssid, info.disconnected.bssid, 6);
        e.reason = info.disconnected.reason;
        this->onWifiDisconnect(e);
        break;
    }
    case SYSTEM_EVENT_AP_STACONNECTED:
    {
        this->onAPConnect(info.sta_connected);
        break;
    }
    case SYSTEM_EVENT_AP_STADISCONNECTED:
        this->onAPDisconnect(info.sta_disconnected);
        break;
    }
}

void ESP8266MQTTMesh::connectWiFiEvents()
{
    meshPtr = this;
    WiFi.onEvent(&staticWiFiEventHandler);
}
#else //USE_WIFI_ONEVENT
void ESP8266MQTTMesh::connectWiFiEvents()
{
    wifiConnectHandler =
        WiFi.onStationModeGotIP(            [this] (const WiFiEventStationModeGotIP& e) {                this->onWifiConnect(e);    }); 
    wifiDisconnectHandler =
        WiFi.onStationModeDisconnected(     [this] (const WiFiEventStationModeDisconnected& e) {         this->onWifiDisconnect(e); });
    //wifiDHCPTimeoutHandler =
    //    WiFi.onStationModeDHCPTimeout(      [this] () {                                                  this->onDHCPTimeout();     });
    wifiAPConnectHandler =
        WiFi.onSoftAPModeStationConnected(  [this] (const WiFiEventSoftAPModeStationConnected& ip) {     this->onAPConnect(ip);     });
    wifiAPDisconnectHandler =
        WiFi.onSoftAPModeStationDisconnected([this] (const WiFiEventSoftAPModeStationDisconnected& ip) { this->onAPDisconnect(ip);  });
}
#endif //USE_WIFI_ONEVENT

uint32_t ESP8266MQTTMesh::lfsr(uint32_t seed, uint8_t b)
{
    // Linear feedback shift register with 32-bit Xilinx polinomial x^32 + x^22 + x^2 + x + 1
    // http://www.xilinx.com/support/documentation/application_notes/xapp052.pdf
    static const uint32_t LFSR_FEEDBACK = 0x80200003ul;
    static const uint32_t LFSR_INTAP = 32-1;
    for (int i = 0; i < 8; ++i) {
        seed = (seed >> 1) ^ ((-(seed & 1u) & LFSR_FEEDBACK) ^ ~((uint32_t)(b & 1) << LFSR_INTAP));
        b >>= 1;
    }
    return seed;
}

uint32_t ESP8266MQTTMesh::encrypt_id(uint32_t id) {
    // The lowest bits of the 1st octet need to be b'10 to indicate a
    // locally-administered unicast MAC address
    return (((lfsr(id, 0) * mesh_bssid_key) << 3) + 2) & 0x00FFFFFF;
}

void ESP8266MQTTMesh::generate_mac(uint8_t *bssid, uint32_t id) {
    uint32_t res = encrypt_id(id);
    for(int i = 0; i < 3; i++) {
        bssid[i] = (res >> (8 * i)) & 0xff;
    }
    for(int i = 0; i < 3; i++) {
        bssid[5-i] = (id >> (8 * i)) & 0xff;
    }
}

bool ESP8266MQTTMesh::verify_bssid(uint8_t *bssid) {
    //bit 3 is 1 for station and 0 for AP
    uint32_t wanted = ((bssid[2] << 16) | (bssid[1] << 8) | bssid[0]) & 0xFFFFFFFB;
    uint32_t id = (bssid[3] << 16) | (bssid[4] << 8) | bssid[5];
    uint32_t res = encrypt_id(id);
    return res == wanted;
}

bool ESP8266MQTTMesh::connected() {
    return wifiConnected() && ((meshConnect && espClient[0] && espClient[0]->connected()) || mqttClient.connected());
}

void ESP8266MQTTMesh::scan() {
    //Need to rescan
    if (! scanning) {
        ap_ptr = NULL;
        WiFi.disconnect();
        WiFi.mode(WIFI_STA);
        dbgPrintln(EMMDBG_WIFI, "Scanning for networks");
        WiFi.scanDelete();
        WiFi.scanNetworks(true,true);
        scanning = true;
    }

    //scanComplete returns <0 while scanning is in progress
    int numberOfNetworksFound = WiFi.scanComplete();
    if (numberOfNetworksFound < 0) {
        return;
    }
    dbgPrintln(EMMDBG_WIFI, "Found: " + String(numberOfNetworksFound));

    scanning = false;

    //Initialize AP to be empty, and all unused APs on the unused list
    if (ap_unused == NULL) {
        ap_unused = ap;
    } else {
        for(ap_ptr = ap_unused; ap_ptr->next != NULL; ap_ptr = ap_ptr->next)
        {}
        ap_ptr->next = ap;
    }
    ap = NULL;

    for(int i = 0; i < numberOfNetworksFound; i++) {
        int network_idx = NETWORK_MESH_NODE;
        int rssi = WiFi.RSSI(i);
        dbgPrintln(EMMDBG_WIFI, "Found SSID: '" + WiFi.SSID(i) + "' BSSID '" + WiFi.BSSIDstr(i) + "'" + " RSSI: " + String(rssi));
        if (IS_GATEWAY) { //Always true except if configured that only a specific Node is allowed to connect to the real Acess Point
            network_idx = match_networks(WiFi.SSID(i).c_str(), WiFi.BSSIDstr(i).c_str());
        }
        if(network_idx == NETWORK_MESH_NODE) {
            if (WiFi.SSID(i).length()) { //Mesh Nodes have no SSID, so here are only "real" Acess Points, which did not matched the AP List
                dbgPrintln(EMMDBG_WIFI_EXTRA, "Did not match SSID list");
                continue;
            } else { //Here the Mesh Nodes are handled
                if (! verify_bssid(WiFi.BSSID(i))) { //Check if the Node is a Mesh Node, if not just ignore this Signal
                    dbgPrintln(EMMDBG_WIFI_EXTRA, "Failed to match BSSID");
                    continue;
                }
            }
        }//else Connection is a direct Access Point which matched the Access Point Credential List
        ap_t *next_ap;
        if (ap_unused == NULL) {
            next_ap = new ap_t;
        } else {
            next_ap =ap_unused;
            ap_unused = ap_unused->next;
        }
        //Assign next_ap
        next_ap->ssid_idx = network_idx;
        next_ap->rssi = rssi;
        memcpy(next_ap->bssid, WiFi.BSSID(i), 6);

        //sort by RSSI
        ap_t *ap_last = NULL;
        for(ap_ptr = ap; ap_ptr != NULL; ap_last = ap_ptr, ap_ptr = ap_ptr->next) {
            if(network_idx != NETWORK_MESH_NODE) {
                //Tested Signal is Wifi AP
                if ((ap_ptr->ssid_idx == NETWORK_MESH_NODE && //Current Signal is Mesh Node
                     (rssi >= -80 || rssi >= ap_ptr->rssi))|| //and Signal under Test to direct AP have to be quite decent or at least better then current one
                     (ap_ptr->ssid_idx != NETWORK_MESH_NODE && rssi >= ap_ptr->rssi))//or both are Ap Points, but tested one have stronger Signal
                {
                    break;
                }
            } else {
                //Tested Signal is mesh node
                if ((ap_ptr->ssid_idx == NETWORK_MESH_NODE || //if Actual Node is Mesh Node
                    (ap_ptr->ssid_idx != NETWORK_MESH_NODE && ap_ptr->rssi <= -80)) && //or is AP, but with weak Signal
                      rssi >= ap_ptr->rssi) //and in either Way have better Connection then actuall one
                {
                    break;
                }
            }
        }
        //Insert next_ap before ap_ptr (i.e. at last_ap)
        next_ap->next = ap_ptr;
        if (ap_last) {
            ap_last->next = next_ap;
        } else {
            //ap was empty, so create it
            ap = next_ap;
        }
    }
    ap_ptr = ap;
}

int ESP8266MQTTMesh::match_networks(const char *ssid, const char *bssid)
{
    for(int idx = 0; networks[idx].ssid != NULL; idx++) {
        if(networks[idx].bssid) {
            if (strcmp(bssid, networks[idx].bssid) == 0) {
                if (networks[idx].hidden && ssid[0] == 0) {
                    //hidden network
                    dbgPrintln(EMMDBG_WIFI, "Matched");
                    return idx;
                }
            } else {
                //Didn't match requested bssid
                continue;
            }
        }
        dbgPrintln(EMMDBG_WIFI_EXTRA, "Comparing " + String(networks[idx].ssid));
        if(ssid[0] != 0) {
            if ((! networks[idx].hidden) && strcmp(ssid, networks[idx].ssid) == 0) {
                //matched ssid (and bssid if needed)
                dbgPrintln(EMMDBG_WIFI, "Matched");
                return idx;
            }
        }
    }
    return NETWORK_MESH_NODE;
}

void ESP8266MQTTMesh::schedule_connect(float delay) {
    if(connectScheduled){
        return
    }
    connectScheduled = true;
    dbgPrintln(EMMDBG_WIFI_EXTRA, "Scheduling reconnect for " + String(delay,2)+ " seconds from now");
    schedule.once(delay, connect, this);
}

void ESP8266MQTTMesh::connect() {
    connectScheduled = false;
    if (WiFi.isConnected()) {
        dbgPrintln(EMMDBG_WIFI, "Called connect when already connected!");
        return;
    }
    retry_connect = 1;
    if (scanning || ! ap_ptr) {
        scan();
    }
    if (scanning) {
        schedule_connect(0.5);
        return;
    }
    if (! ap_ptr) {
        // No networks found, try again
        schedule_connect(5.0);
        return;
    }
    int i = 0;
    for (ap_t *p = ap; p != NULL; p = p->next, i++) {
        dbgPrintln(EMMDBG_WIFI, String(i) + String(p == ap_ptr ? " * " : "   ") + mac_str(p->bssid) + " " + String(p->rssi));
    }
    char _mesh_ssid[32];
    const char *ssid;
    const char *password;
    if (ap_ptr->ssid_idx == NETWORK_MESH_NODE) {
        //This is a mesh node
        ssid = build_mesh_ssid(_mesh_ssid, ap_ptr->bssid);
        password = mesh_password;
        meshConnect = true;
    } else {
        ssid = networks[ap_ptr->ssid_idx].ssid;
        password = networks[ap_ptr->ssid_idx].password;
        meshConnect = false;
    }
    dbgPrintln(EMMDBG_WIFI, "Connecting to SSID : '" + String(ssid) + "' BSSID '" + mac_str(ap_ptr->bssid) + "'");
    WiFi.begin(ssid, password);
    alreaddyDisconnected = false;
}

String ESP8266MQTTMesh::mac_str(uint8_t *bssid) {
    char mac[19];
    sprintf(mac, "%02X:%02X:%02X:%02X:%02X:%02X", bssid[0], bssid[1], bssid[2], bssid[3], bssid[4], bssid[5]);
    return String(mac);
}
const char *ESP8266MQTTMesh::build_mesh_ssid(char buf[32], uint8_t *mac) {
    char chipid[8];
    sprintf(chipid, "_%02x%02x%02x", mac[3], mac[4], mac[5]);
    strlcpy(buf, mesh_ssid, sizeof(buf)-7);
    strlcat(buf, chipid, sizeof(buf));
    return buf;
}

void ESP8266MQTTMesh::parse_message(const char *topic, const char *msg) {
  int inTopicLen = strlen(inTopic);
  if (strstr(topic, inTopic) != topic) {
      return;
  }
  const char *subtopic = topic + inTopicLen;
  if (strstr(subtopic ,"ota/") == subtopic) {
#if HAS_OTA
      const char *cmd = subtopic + 4;
      handle_ota(cmd, msg);
#endif
      return;
  }
  else if (strstr(subtopic ,"fw/") == subtopic) {
      const char *cmd = subtopic + 3;
      handle_fw(cmd);
  }
  if (! callback) {
      return;
  }
  int myIDLen = strlen(myID);
  if(strstr(subtopic, myID) == subtopic) {
      //Only handle messages addressed to this node
      HandleMessages(subtopic + myIDLen, msg);
  }
  else if(strstr(subtopic, "broadcast/") == subtopic) {
      //Or messages sent to all nodes
      HandleMessages(subtopic + 10, msg);
  }
}

