PhracturedBlue/ESP8266MQTTMesh/src/ESP8266MQTTMesh.cpp
void ESP8266MQTTMesh::HandleMessages(const char *topic, const char *msg) {
  if(strstr(topic,"Ping") == topic){
    dbgPrintln(EMMDBG_MSG, "answering Ping!");
    String topic = "Ping";
    publish(topic.c_str(), String(1).c_str());
  }else if(strstr(topic,"Restart") == topic){
    dbgPrintln(EMMDBG_MSG, "Got Restart Command, restarting now");
    die();
  }else{
    callback(topic, msg);
  }
}

void ESP8266MQTTMesh::connect_mqtt() {
    dbgPrintln(EMMDBG_MQTT, "Attempting MQTT connection (" + mqtt_server + ":" + String(mqtt_port) + ")...");
    // Attempt to connect
    mqttClient.connect();
}


void ESP8266MQTTMesh::publish(const char *subtopic, const char *msg, enum MSG_TYPE msgCmd) {
    publish(outTopic, myID, subtopic, msg, msgCmd);
}

void ESP8266MQTTMesh::publish_node(const char *subtopic, const char *msg, enum MSG_TYPE msgCmd) {
    publish(inTopic, myID, subtopic, msg, msgCmd);
}

void ESP8266MQTTMesh::publish(const char *topicDirection, const char *baseTopic, const char *subTopic, const char *msg, uint8_t msgType) {
    char topic[64];
    strlcpy(topic, topicDirection, sizeof(topic));
    strlcat(topic, baseTopic, sizeof(topic));
    strlcat(topic, subTopic, sizeof(topic));
    dbgPrintln(EMMDBG_MQTT_EXTRA, "Sending: " + String(topic) + "=" + String(msg));
    if (! meshConnect) {
        mqtt_publish(topic, msg, msgType);
    } else {
        send_message(0, topic, msg, msgType);
    }
}

void ESP8266MQTTMesh::shutdown_AP() {
    if(! AP_ready)
        return;
    for (int i = 1; i <= ESP8266_NUM_CLIENTS; i++) {
        if(espClient[i]) {
            delete espClient[i];
            espClient[i] = NULL;
        }
    }
    WiFi.softAPdisconnect(true);
    WiFi.mode(WIFI_STA);
    AP_ready = false;
}

void ESP8266MQTTMesh::setup_AP() {
    if (AP_ready)
        return;
    
    uint octet2 = WiFi.gatewayIP()[1] + 1;
    if (octet2==255) {
        octet2++;
    }
    if (octet2==0) {
        octet2++;
    }
    IPAddress apIP(WiFi.gatewayIP()[0],
                   octet2,
                   1,
                   1);
    IPAddress apGateway(apIP);
    IPAddress apSubmask(255, 255, 255, 0);
    WiFi.mode(WIFI_AP_STA);
    WiFi.softAPConfig(apIP, apGateway, apSubmask);
    char _mesh_ssid[32];
    uint8_t mac[6];
    build_mesh_ssid(_mesh_ssid, WiFi.softAPmacAddress(mac));
    WiFi.softAP(_mesh_ssid, mesh_password, WiFi.channel(), 1);
    dbgPrintln(EMMDBG_WIFI, "Initialized AP as '" + String(_mesh_ssid) + "'  IP '" + apIP.toString() + "'");
    AP_ready = true;
}

void ESP8266MQTTMesh::send_connected_msg() {
    //The list of nodes is only stored on the broker.  Individual nodes don't knowother node IDs
    /*char topic[10];
    strlcpy(topic, myID, sizeof(topic));
    topic[strlen(topic)-1] = 0; // Chop off trailing '/'
    publish(outTopic, "bssid/", topic, WiFi.softAPmacAddress().c_str(), MSG_TYPE_RETAIN_QOS_0);*/
    if(wasConnected){
        publish("info/reset_Reason", String("lost_Connection").c_str(), MSG_TYPE_RETAIN_QOS_0);
    }else{
        publish("info/reset_Reason", String(ESP.getResetReason()).c_str(), MSG_TYPE_RETAIN_QOS_0);
    }
    publish("info/MAC", String(WiFi.macAddress()).c_str(), MSG_TYPE_RETAIN_QOS_0);
    publish("info/MAC_hosted_AP", String(WiFi.softAPmacAddress()).c_str(), MSG_TYPE_RETAIN_QOS_0);
    publish("info/IP_local", WiFi.localIP().toString().c_str(), MSG_TYPE_RETAIN_QOS_0);
    publish("info/RSSI", String(ap_ptr->rssi).c_str(), MSG_TYPE_RETAIN_QOS_0);
    publish("info/connectedTo", String(mac_str(ap_ptr->bssid)).c_str(), MSG_TYPE_RETAIN_QOS_0);
}

bool ESP8266MQTTMesh::send_message(int index, const char *topicOrMsg, const char *msg, uint8_t msgType) {
    char msgTypeStr[2];
    if (msgType == 0) {
        msgType = MSG_TYPE_INVALID;
    }
    msgTypeStr[0] = msgType;
    msgTypeStr[1] = 0;
    if (index == 0) {
        //We only send the msgType upstream
        espClient[index]->write(msgTypeStr,1);
    }
    espClient[index]->write(topicOrMsg);
    if (msg) {
        espClient[index]->write("=", 1);
        espClient[index]->write(msg);
    }
    espClient[index]->write("\0", 1);
    return true;
}

void ESP8266MQTTMesh::broadcast_message(const char *topicOrMsg, const char *msg) {
    for (int i = 1; i <= ESP8266_NUM_CLIENTS; i++) {
        if (espClient[i]) {
            send_message(i, topicOrMsg, msg);
        }
    }
}

void ESP8266MQTTMesh::handle_client_data(int idx, char *rawdata) {
            dbgPrintln(EMMDBG_MQTT_EXTRA, "Received: msg from " + espClient[idx]->remoteIP().toString() + " on " + (idx == 0 ? "STA" : "AP"));
            const char *data = rawdata + (idx ? 1 : 0); //packages from other Modules use the first bit as an Message Type
            dbgPrintln(EMMDBG_MQTT_EXTRA, "--> '" + String(data) + "'");
            char topic[64];
            const char *msg;
            if (! keyValue(data, '=', topic, sizeof(topic), &msg)) {
                dbgPrintln(EMMDBG_MQTT, "Failed to handle message");
                return;
            }
            if (idx == 0) {
                //This is a packet from MQTT, need to rebroadcast to each connected station
                broadcast_message(data);
                parse_message(topic, msg);
            } else {
                unsigned char msgType = rawdata[0];
                if (strstr(topic,"/mesh_cmd")  == topic + strlen(topic) - 9) {
                    // We will handle this packet locally
                    // TODO: implement proper Routing instead of broadcasting each Package! connected Modules can communicate with this one by using the Topic "/mesh_cmd/..."
                    dbgPrintln(EMMDBG_MQTT, "received unknown Mesh Command from connected Node");
                } else {
                    if (! meshConnect) {
                        mqtt_publish(topic, msg, msgType);
                    } else {
                        send_message(0, data, NULL, msgType);
                    }
                }
            }
}

uint16_t ESP8266MQTTMesh::mqtt_publish(const char *topic, const char *msg, uint8_t msgType)
{
    uint8_t qos = 0;
    bool retain = false;
    if (msgType == MSG_TYPE_RETAIN_QOS_0
        || msgType == MSG_TYPE_RETAIN_QOS_1
        || msgType == MSG_TYPE_RETAIN_QOS_2)
    {
        qos = msgType - MSG_TYPE_RETAIN_QOS_0;
        retain = true;
    }
    else if(msgType == MSG_TYPE_QOS_0
            || msgType == MSG_TYPE_QOS_1
            || msgType == MSG_TYPE_QOS_2)
    {
        qos = msgType - MSG_TYPE_QOS_0;
    }
    return mqttClient.publish(topic, qos, retain, msg);
}

